'''
**문제 1**— Apache 로그에서 상태 코드(403)만 그룹으로 추출하는 정규식과 코드를 작성해 봅시다.
'''
apache_log = '192.168.10.55 - admin [05/Apr/2026:14:20:01 +0900] GET /etc/passwd HTTP/1.1 403 531'




'''
**문제 2** — 위 로그에서 IP 주소만 추출하는 코드를 작성해 봅시다. (`^`으로 시작 위치를 고정하고 그룹으로 감싸세요.)
'''
apache_log = '192.168.10.55 - admin [05/Apr/2026:14:20:01 +0900] GET /etc/passwd HTTP/1.1 403 531'




'''
**문제 3** — 리눅스 SSH 로그에서 공격자 IP와 포트 번호를 각각 그룹으로 추출하는 정규식을 작성해 봅시다.
'''
ssh_log = 'Apr 5 22:10:05 server01 sshd[1234]: Failed password for root from 211.23.45.10 port 54321 ssh2'